import photo1 from "../assets/photos/photo1.png";
import photo2 from "../assets/photos/photo2.png";
import photo3 from "../assets/photos/photo3.png";
import photo4 from "../assets/photos/photo4.png";
import photo5 from "../assets/photos/photo5.png";
import photo6 from "../assets/photos/photo6.png";
import photo7 from "../assets/photos/photo7.png";
import photo8 from "../assets/photos/photo8.png";
import photo9 from "../assets/photos/photo9.png";
import photo10 from "../assets/photos/photo10.png";
import photo11 from "../assets/photos/photo11.png";
import photo12 from "../assets/photos/photo12.png";
import photo13 from "../assets/photos/photo13.png";
import photo14 from "../assets/photos/photo14.png";
import photo15 from "../assets/photos/photo15.png";
import photo16 from "../assets/photos/photo16.png";
import photo17 from "../assets/photos/photo17.png";
import photo18 from "../assets/photos/photo18.png";
import photo19 from "../assets/photos/photo19.png";
import photo20 from "../assets/photos/photo20.png";
import photo21 from "../assets/photos/photo21.png";
import photo22 from "../assets/photos/photo22.png";
import photo23 from "../assets/photos/photo23.png";
import photo24 from "../assets/photos/photo24.png";
import photo25 from "../assets/photos/photo25.png";
import photo26 from "../assets/photos/photo26.png";

export const albumPages = [

    {
        layout: "single",

        photos: [
            photo1
        ],

        text: "Именно отсюда и будет начинаться твоя история. Тогда никто не знал, сколько счастливых моментов ждет тебя впереди и сколько людей будут любить тебя всем сердцем. Ты была совсем еще малышечкой, но уже стала самым большим счастьем для своей семьи. А спустя годы ты даже не представляешь, что появиться человек (типа я короче), который будет смотреть на эту фотографию с улыбкой и думать: «Как же я рада, что ты тогда появилась на свет» "
    },

    {
        layout: "single",

        photos: [
            photo2
        ],

        text: "Тут ты тоже малая, но уже трохи больше. Казаться у тебя вообще не было причин грустить. Ты класнюче улыбаешься, что не возможно не улыбаться тоже когда смотришь на это фото. И знаешь, мне кажется что именно такую улыбку я встречаю каждый раз когда ты смеешься рядом со мной. (Это моя любимая твоя фотка кста) "
    },

    {
        layout: "double",

        photos: [
            photo3,
            photo4
        ],

        text: "Ну на этих фотках ты уже прям гигант. Девочка зайка и человек мишура. Мне нравиться иногда представлять сколько счастливых моментов было у тебя в детстве, потому что ты каждый раз рассказываешь о них с теплотой и каким то особенным трепетом. И как же все таки здорово что некоторые из них сохранились на таких детских снимках. "
    },
    {
    layout: "double",

    photos: [
        photo5,
        photo6
    ],

    text: " Это начало совершенно нового этапа твоей жизни. Я не могу поверить, наверное как и ты, что эти фотографии были сделаны так давно.  Впереди было столько всего неизвестного: новые друзья, первые успехи, ошибки и мечты. Ты еще не знала, сколько всего сможешь преодолеть и насколько сильной вырастешь. Но именно с таких маленьких шагов начинается большое путешествие."
},
{
    layout: "single",

    photos: [
        photo7
    ],

    text: "Есть фотографии, от которых будто пахнет летом. Эта именно такая. Беззаботные дни, солнце, вода и ощущение, что впереди еще целые каникулы. Oчень хочется, чтобы чувство легкости, которое было тогда, никогда полностью не исчезало из твоей жизни и ты оставалась такой же радостной как тогда. "
},
{
    layout: "double",

    photos: [
        photo8,
        photo9
    ],

    text: "Мне очень нравятся эта фотографии, потому что они показывают, насколько ты умеешь делать что-то необычное. Даже из самых простых вещей можно создать что-то красивое, если подойти к этому с фантазией. Кажется, это всегда было одной из твоих сильных сторон. И именно поэтому рядом с тобой никогда не бывает скучно. (Ну и конечно я знатно посмеялась с этой малышки в пакете)"
},
{
    layout: "double",

    photos: [
        photo10,
        photo11
    ],

    text: "На эти фотографии было подрочено раз 20, но я не об этом. Тогда и был твой прайм, сейчас конечно ты тоже более менее, но такой крутой как тогда ты больше не будешь. Мне очень нравится, что ты никогда не боялась быть собой и пробовать что-то новое. Именно эта смелость делает тебя такой особенной. Я жалею что не помню тебя тогда, но твоих рассказов и этих фоток мне хватило что бы понять, что ты точно та самая."
},
{
    layout: "double",

    photos: [
        photo12,
        photo13
    ],

    text: "Вот с этого и начался этот порочный круг. Каждый раз когда я перечитываю наши первые переписки, у меня появляется чувство что я читаю переписку Ксюхи с очередной (так себе сравнение, но я чур за очередную). Я не могу поверить что сейчас мы стали как будто другими людьми, старше, умнее (сомнительно), но точно ближе. Порой страшно осознавать, что это было почти 2 года назад, но с первого сообщения тебе я уже понимала что захочу возвращаться в этот чат снова и снова. "
},
{
    layout: "double",

    photos: [
        photo14,
        photo15
    ],

    text: "Это наша первая встреча вживую после интернет геройства. По совместительству наш первый совместный поход в святая святых KFC (там на фотке еще байтс в форме пениса типа). Мне было супер неловко, но после первых минут 20, я поняла что с тобой мне нечего боятся. Сейчас я  вспоминаю это как одну из наших обычных встреч, но именно тогда переписка окончательно превратилась в настоящие воспоминания, которых я хочу иметь с тобой еще больше. "
},
{
    layout: "triple-horizontal",

    photos: [
        photo16,
        photo17,
        photo18
    ],

    text: "Наверное, никто не поймет нас лучше, чем мы сами, когда речь заходит об играх. Мы можем часами строиться в нашей влв деревне, проходить хорроры в роблоксе, смеятьс когда у кого то скример и совсем не замечать, как летит время. Но именно майнкрафт стал одним из тех воспоминаний, которые навсегда останутся для меня особенными, потому что мы впервые прошли его ВМЕСТЕ. Каждый раз когда я с кем то играю в него, я понимаю что так классно как с тобой в нашем мире мне уже не будет. Я, конечно, люблю играть в игры, но не так сильно как люблю играть в них с тобой. "
},
{
    layout: "mix",

    photos: [
        photo19,
        photo20,
        photo21
    ],

    text: "Oooo тогда и появились мои любимые фотки с тобой. Я хорошо помню тот зимний вечер, в который, кажется, никто не замерз. Эта прогулка стала одним из тех вечеров, которые хочется вспоминать снова и снова. Именно в тот день я по настоящему поняла, что счастье — это просто идти рядом с тобой и не думать что будет завтра."
},
{
    layout: "mix",

    photos: [
        photo24,
        photo22,
        photo23
    ],

    text: "Я очень рада, что смогла быть рядом в такой важный день. Видеть твою улыбку, поздравлять тебя и разделять этот праздник — уже было для меня подарком. Мне хочется встречать с тобой еще очень много дней рождения, радоваться твоим успехам и просто быть рядом. Потому что именно рядом с тобой я чувствую себя счастливой."
},
{
    layout: "double",

    photos: [
        photo25,
        photo26
    ],

    text: "Если бы кто-то показал мне первую страницу этого альбома много лет назад, я бы никогда не догадалась, чем закончится эта история. Маленькая девочка с первых фотографий выросла и стала человеком, без которого я уже не представляю свою жизнь. Спасибо тебе за каждую улыбку, каждое объятие, каждую игру до поздней ночи и каждое воспоминание, которое мы уже успели создать вместе. Я очень надеюсь, что этот альбом никогда не станет завершенной историей, потому что самые красивые страницы нашей жизни мы еще напишем. Я люблю тебя."
},
];